//--------------------------------------------------------------------------------
// カメラエディター
//--------------------------------------------------------------------------------
#pragma once
#include "camera.h"
//--------------------------------------------------------------------------------
// クラス
//--------------------------------------------------------------------------------
class CameraEdit :
    public Camera
{
    friend class BehaviorEdit;
public:
    CameraEdit();
    ~CameraEdit();

    void Init(void)override;
    void Update(void)override;

private:
    //--------------------------------------------------------------------------------
    // メンバー変数
    //--------------------------------------------------------------------------------
    float  m_rotation_speed=0.003f;   // 回転速度
    float  m_zoom_speed = 0.03f;      // ズーム速度
    float  m_distance_min = 3.0f;    // 注視点と注目点の距離（最小）
    float  m_distance_max = 500.0f;  // 注視点と注目点の距離（最大）
};

