//--------------------------------------------------------------------------------
//  タイマー
//--------------------------------------------------------------------------------
#include "timer.h"
#include "main.h"
Timer* Timer::m_instans=NULL;
//--------------------------------------------------------------------------------
//  リリース
//--------------------------------------------------------------------------------
void Timer::Release()
{
    delete m_instans;
}
//--------------------------------------------------------------------------------
//  セット開始時間
//--------------------------------------------------------------------------------
void Timer::SetBeginTime(void)
{
    QueryPerformanceCounter(&m_exec_last_time);
}
//--------------------------------------------------------------------------------
//  １フレーム更新時間チェック
//--------------------------------------------------------------------------------
bool Timer::CanUpdateFrame()
{
    QueryPerformanceFrequency(&m_frequency);
    QueryPerformanceCounter(&m_current_time);

    m_delta_time = c_time_interval;

    if (m_delta_time >= c_time_interval)
    {
        m_exec_last_time = m_current_time;
        return true;
    }
    return false;
}
//--------------------------------------------------------------------------------
//  生成
//--------------------------------------------------------------------------------
Timer* Timer::Create()
{
    m_instans = new Timer;
    return m_instans;
}
