//--------------------------------------------------------------------------------
// フィールドコライダー
//--------------------------------------------------------------------------------
#pragma once
#include "collider.h"
#include "main.h"
#include <vector>

using namespace std;

//--------------------------------------------------------------------------------
// 構造体
//--------------------------------------------------------------------------------
struct PolygonInfo//ポリゴン情報
{
    D3DXVECTOR3 left_up;
    D3DXVECTOR3 right_down;
    D3DXVECTOR3 side;
    D3DXVECTOR3 normal;
};
//--------------------------------------------------------------------------------
// クラス
//--------------------------------------------------------------------------------
class ColliderField :
    public Collider
{
public:
    ColliderField(GameObject* game_object,const string& name) :Collider(game_object, "ColliderFiled", COLLIDER_FIELD),
        m_block_number_x(0),
        m_block_number_z(0),
        m_block_size(D3DXVECTOR2(0,0))
    {
        Load(name);
    }
    ~ColliderField();
    //--------------------------------------------------------------------------------
    // ゲットポリゴン情報
    //--------------------------------------------------------------------------------
    PolygonInfo* GetPolygon(const D3DXVECTOR3& vertex)const;
private:
    //--------------------------------------------------------------------------------
    // メンバー変数
    //--------------------------------------------------------------------------------
    int                 m_block_number_x;
    int                 m_block_number_z;
    D3DXVECTOR2         m_block_size;
    vector<D3DXVECTOR3> m_vertexes;
    //--------------------------------------------------------------------------------
    // ロード
    //--------------------------------------------------------------------------------
    void Load(const string& name);
};

